
// -------- Клас елемент ієрархії -------
class Share {
	protected:
		int Level, pos_J;		// рівень елемента і його позиція на цьому рівні
		int x0, y0;				// координати центра об'єкта
		int width, height;		// розміри прямокутника 
	public:
		void Set(int, int, int, int, int, int);		// функція встановлення параметрів
		void GetLevelAndPosJ(int &, int &);			// функція визначення рівня даного елемента і його позицію на цьому рівні
		virtual void SetAlteration(int, int) = 0;	// зміна відстаней між рівнями та між елементами рівня
		virtual void Draw(HWND, HDC) = 0;			// чисто віртуальна функція малювання 	
	};
// ---------- клас заокруглених прямокутників з тектом всередині
class RectAndText : public Share {
	private:
		char CaptionName[30];	// заголовок (назва файлу)
		char CaptionText[300];	// текст з #include-файлами
		bool marked = FALSE;	// признак виділення об'єкта (для обміну)
	public:
		void SetText(char *, char *);			// функція встановлення параметрів тексту в елементі
		void SetAlteration(int, int);			// зміна відстаней між рівнями та між елементами рівня
		void SetMarked();						// змінити признак виділення об'єкта (для обміну та переміщення)	
		bool GetMarked();						// визначити чи виділений об'єкта (для обміну та переміщення)
		void GetXY(int &, int &, int &, int &);	// функція визначення координат верхнього лівого та нижнього правого кутів даного елемента
		void Draw(HWND, HDC);					// функція малювання елементів класу	
};

// ---------- клас стрілок 
class ArrowShare : public Share {
	private:
		int xAr, yAr;			// координати початку стрілки (середина прямокутника нижнього рівня)
		int height_yAr;			// висота прямокутника нижнього рівня, від якого виходить стрілка
		int LevelIn, pos_In;	// рівень і позиція елемента на нижньому рівні (від якого йде сюди стрілка)
	public:
		void SetArrow(int, int, int, int, int);		// функція встановлення параметрів стрілок
		void SetAlteration(int, int);				// зміна відстаней між рівнями та між елементами рівня
		void Draw(HWND, HDC);						// функція малювання елементів класу 	
};


